import sys
input = sys.stdin.readline

t = int(input())
for _ in range(t):
    dp = [1,1]
    n = int(input())
    for i in range(2,n+1):
        dp.append(sum(dp[i-num] for num in [1,2,3] if i-num>=0))
    print(dp[-1])


'''

dp[n-1] dp[n-2] dp[n-3]의 합 !
당연히 n-i가 가능할때만
'''

'''

1
1
>1

2
1+1
2
>2

3
1+1+1
1+2
2+1
3
>4

4
1+1+1+1
1+1+2
1+2+1
2+1+1
2+2
1+3
3+1
>7

5
>13

1+1+1+1+1.
1+1+1+2.
1+1+2+1.
1+2+1+1.
2+1+1+1.
1+1+3.
1+3+1.
3+1+1.
2+2+1.
2+1+2.
1+2+2.
2+3.
3+2.


6
>24?
[5] [4] [3]

7
>44
[6] [5] [4]

8
>81?
[7] [6] [5]

9
> 149
[8] [7] [6]

10
[9] [8][7]
'''

'''
'''